"""创建一个普通列表"""
member = ["小甲鱼", "小布丁", "黑夜","骨精灵","幽梦影","祭剑魂"]
print(member)
""" 打印结果
['小甲鱼', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂']
"""

number = [1, 2, 3, 4, 5]
print(number)
""" 打印结果
[1, 2, 3, 4, 5]
"""

"""创建混合列表"""
mix = [1, "小布丁", 3.14, [1, 2, 3]]
print(mix)
""" 打印结果
[1, '小布丁', 3.14, [1, 2, 3]]
"""

"""创建空列表"""
empty = []
print(empty)
""" 打印结果
[]
"""

"""--------------向列表中添加元素 append一次只能添加一个---------------"""
member.append("神天兵")
print(member)
""" 打印结果
['小甲鱼', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵']
"""

"""extend扩展也只能添加一个参数"""
member.extend(["媚灵狐", "逍遥生"])
print(member)
""" 打印结果
['小甲鱼', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""

"""插入一个参数insert"""
member.insert(0, "崔")
print(member)
""" 打印结果
['小甲鱼', '崔', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""



