"""创建一个普通列表"""
member = ["小甲鱼", "小布丁", "黑夜","骨精灵","幽梦影","祭剑魂"]
print(member)
""" 打印结果
['小甲鱼', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂']
"""

number = [1, 2, 3, 4, 5]
print(number)
""" 打印结果
[1, 2, 3, 4, 5]
"""

"""创建混合列表"""
mix = [1, "小布丁", 3.14, [1, 2, 3]]
print(mix)
""" 打印结果
[1, '小布丁', 3.14, [1, 2, 3]]
"""

"""创建空列表"""
empty = []
print(empty)
""" 打印结果
[]
"""

"""--------------向列表中添加元素 append一次只能添加一个---------------"""
member.append("神天兵")
print(member)
""" 打印结果
['小甲鱼', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵']
"""

"""extend扩展也只能添加一个元素"""
member.extend(["媚灵狐", "逍遥生"])
print(member)
""" 打印结果
['小甲鱼', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""

"""插入一个元素insert"""
member.insert(0, "崔")
print(member)
""" 打印结果
['小甲鱼', '崔', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""

"""从列表中获取单个元素-->交换"""
temp = member[1]
member[1] = member[2]
member[2] = temp
print(member)
""" 打印结果
['崔', '小布丁', '小甲鱼', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""

"""从列表中删除元素"""
member.remove("小甲鱼")
print(member)
""" 打印结果
['崔', '小布丁', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""

"""del语句"""
del member[1]
print(member)
""" 打印结果
['崔', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐', '逍遥生']
"""

"""------pop() 默认每次移除最后一个并返回-----"""
name = member.pop()
print(name)
print(member)
""" 打印结果
逍遥生
['崔', '黑夜', '骨精灵', '幽梦影', '祭剑魂', '神天兵', '媚灵狐']
"""

name1 = member.pop(1)
print(name1)
""" 打印结果
黑夜
"""

"""列表分片<获取多个数据>  获得原列表的拷贝，原来列表并没有改变"""
array = member[1:3]
print(array)
""" 打印结果
['骨精灵', '幽梦影']
"""




